tap "blacktop/tap"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "moncho/dry"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Easily rename multiple files using your text editor
brew "massren"
# Node version management
brew "n"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Internet file retriever
brew "wget"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Organize Your macOS Launchpad Apps
brew "blacktop/tap/lporg"
# a Docker manager for the terminal
brew "moncho/dry/dry"
# Desktop password and login vault
cask "bitwarden"
# Server and cloud storage browser
cask "cyberduck"
# Finds duplicate files in a computer system
cask "dupeguru"
# Multi-platform multi-messaging app
cask "ferdium"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# GIT client
cask "fork"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Open-source screen recorder built with web technology
cask "kap"
# Open-source Dropbox client
cask "maestral"
# Minimal browser that protects privacy
cask "min"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# App to switch hosts
cask "switchhosts"
# Web browser focusing on security
cask "tor-browser"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Rust-based terminal
cask "warp"
# BBS client
cask "welly"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Amphetamine", id: 937984704
mas "LINE", id: 539883307
mas "Simplenote", id: 692867256
mas "Spark", id: 1176895641
vscode "adpyke.codesnap"
vscode "albert.TabOut"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "annsk.alignment"
vscode "be5invis.vscode-custom-css"
vscode "bierner.color-info"
vscode "bungcip.better-toml"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dae.vscode-mac-color-picker"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "foxundermoon.shell-format"
vscode "geddski.macros"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hcyang.ctags"
vscode "IBM.output-colorizer"
vscode "iceliu.highlight-icemode"
vscode "iliazeus.vscode-ansi"
vscode "iocave.customize-ui"
vscode "iocave.monkey-patch"
vscode "jakearl.search-editor-apply-changes"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jtanx.ctagsx"
vscode "JuanBlanco.solidity"
vscode "KevinRose.vsc-python-indent"
vscode "LeetCode.vscode-leetcode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "Natizyskunk.sftp"
vscode "naumovs.color-highlight"
vscode "naumovs.theme-oceanicnext"
vscode "rsbondi.highlight-words"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SirTori.indenticator"
vscode "sleistner.vscode-fileutils"
vscode "TabNine.tabnine-vscode"
vscode "teabyii.ayu"
vscode "trixnz.go-to-method"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wmaurer.vscode-jumpy"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
