tap "beeftornado/rmtree"
tap "blacktop/tap"
tap "buo/cask-upgrade"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
# Run your GitHub Actions locally 🚀
brew "act"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# More intuitive version of du in rust
brew "dust"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GIF image/animation creator/editor
brew "gifsicle"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Easily rename multiple files using your text editor
brew "massren"
# Command-line client for Mega.co.nz
brew "megatools"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Node version management
brew "n"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# General-purpose scripting language
brew "php@7.4", link: true
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Modern replacement for ps written by Rust
brew "procs"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch", args: ["HEAD"]
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Organize Your macOS Launchpad Apps
brew "blacktop/tap/lporg"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Application launcher and productivity software
cask "alfred3"
# Combined interface for various messaging platforms
cask "all-in-one-messenger"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Reverse engineering platform powered by Rizin
cask "cutter"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Status monitoring
cask "eul"
cask "font-fira-code"
# GIT client
cask "fork"
# Download accelerator and organizer
cask "free-download-manager"
# Trading application
cask "futubull"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Add code completions to all your code editors
cask "kite"
# Minimal browser that protects privacy
cask "min"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Desktop virtualization software
cask "parallels"
# Web development companion
cask "prepros"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Desktop version of Remix web IDE used for Ethereum smart contract development
cask "remix-ide"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# App to switch hosts
cask "switchhosts"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# BBS client
cask "welly"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Coin Tick", id: 1141688067
mas "GarageBand", id: 682658836
mas "LINE", id: 539883307
mas "NordVPN", id: 905953485
mas "Simplenote", id: 692867256
mas "Spark", id: 1176895641
